Австралия/src/Documents/Event/Event.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Event</name>
  <basedOn>Document.Event</basedOn>
  <basedOn>Document.EmployeeTask</basedOn>
  <basedOn>Document.SalesOrder</basedOn>
  <basedOn>Document.PurchaseOrder</basedOn>
  <basedOn>Document.SupplierInvoice</basedOn>
  <basedOn>Document.SalesInvoice</basedOn>
  <basedOn>Document.Quote</basedOn>
  <basedOn>Document.PaymentExpense</basedOn>
  <basedOn>Document.CashVoucher</basedOn>
  <basedOn>Document.PaymentReceipt</basedOn>
  <basedOn>Document.CashReceipt</basedOn>
  <basedOn>Document.AccountSalesFromConsignee</basedOn>
  <basedOn>Document.AccountSalesToConsignor</basedOn>
  <basedOn>Catalog.Counterparties</basedOn>
  <basedOn>Catalog.ContactPersons</basedOn>
  <basedOn>Document.SupplierQuote</basedOn>
  <basedOn>Document.ReconciliationStatement</basedOn>
  <basedOn>Document.ProductionOrder</basedOn>
  <basedOn>Document.CreditNote</basedOn>
  <basedOn>Document.DebitNote</basedOn>
  <basedOn>Document.WorkOrder</basedOn>
  <basedOn>Document.SubcontractorInvoiceReceived</basedOn>
  <basedOn>Document.SubcontractorOrderIssued</basedOn>
  <basedOn>Document.SubcontractorInvoiceIssued</basedOn>
  <basedOn>Document.KitOrder</basedOn>
  <basedOn>Document.ActualSalesVolume</basedOn>
  <basedOn>Document.DirectDebit</basedOn>
  <basedOn>Document.SubcontractorOrderReceived</basedOn>
  <basedOn>Document.OnlineReceipt</basedOn>
  <basedOn>Document.OnlinePayment</basedOn>
  <posting>Deny</posting>
  <attributes>
    <name>EventType</name>
    <type>
      <types>EnumRef.EventTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>State</name>
    <type>
      <types>CatalogRef.JobAndEventStatuses</types>
    </type>
  </attributes>
  <attributes>
    <name>IncomingOutgoingEvent</name>
    <type>
      <types>EnumRef.IncomingOutgoingEvent</types>
    </type>
  </attributes>
  <attributes>
    <name>Subject</name>
    <type>
      <types>String</types>
      <types>CatalogRef.EventsSubjects</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Content</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ContentHTML</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ImagesHTML</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>BasisDocument</name>
    <type>
      <types>DocumentRef.SalesInvoice</types>
      <types>DocumentRef.AccountSalesFromConsignee</types>
      <types>DocumentRef.ReconciliationStatement</types>
      <types>DocumentRef.SupplierInvoice</types>
      <types>DocumentRef.SubcontractorInvoiceReceived</types>
      <types>DocumentRef.EmployeeTask</types>
      <types>DocumentRef.SubcontractorOrderIssued</types>
      <types>DocumentRef.PaymentExpense</types>
      <types>DocumentRef.DebitNote</types>
      <types>DocumentRef.CashReceipt</types>
      <types>DocumentRef.SalesOrder</types>
      <types>DocumentRef.ProductionOrder</types>
      <types>DocumentRef.CreditNote</types>
      <types>DocumentRef.Quote</types>
      <types>DocumentRef.Event</types>
      <types>DocumentRef.ActualSalesVolume</types>
      <types>DocumentRef.AccountSalesToConsignor</types>
      <types>DocumentRef.OnlineReceipt</types>
      <types>DocumentRef.CashVoucher</types>
      <types>DocumentRef.PurchaseOrder</types>
      <types>DocumentRef.BulkMail</types>
      <types>DocumentRef.PaymentReceipt</types>
      <types>DocumentRef.OnlinePayment</types>
      <types>DocumentRef.SupplierQuote</types>
      <types>DocumentRef.DirectDebit</types>
    </type>
  </attributes>
  <attributes>
    <name>EventBegin</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>EventEnding</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Responsible</name>
    <type>
      <types>CatalogRef.Employees</types>
    </type>
  </attributes>
  <attributes>
    <name>ParticipantsList</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Author</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>Project</name>
    <type>
      <types>CatalogRef.Projects</types>
    </type>
  </attributes>
  <attributes>
    <name>UserAccount</name>
    <type>
      <types>CatalogRef.EmailAccounts</types>
    </type>
  </attributes>
  <attributes>
    <name>SMSSenderName</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>BasisDocuments</name>
    <attributes>
      <name>BasisDocument</name>
      <type>
        <types>DocumentRef.SalesInvoice</types>
        <types>DocumentRef.AccountSalesFromConsignee</types>
        <types>DocumentRef.ReconciliationStatement</types>
        <types>DocumentRef.SupplierInvoice</types>
        <types>DocumentRef.SubcontractorInvoiceReceived</types>
        <types>DocumentRef.EmployeeTask</types>
        <types>DocumentRef.SubcontractorOrderIssued</types>
        <types>DocumentRef.PaymentExpense</types>
        <types>DocumentRef.DebitNote</types>
        <types>DocumentRef.CashReceipt</types>
        <types>DocumentRef.SalesOrder</types>
        <types>DocumentRef.SubcontractorOrderReceived</types>
        <types>DocumentRef.ProductionOrder</types>
        <types>DocumentRef.CreditNote</types>
        <types>DocumentRef.SubcontractorInvoiceIssued</types>
        <types>DocumentRef.Quote</types>
        <types>DocumentRef.Event</types>
        <types>DocumentRef.ActualSalesVolume</types>
        <types>DocumentRef.AccountSalesToConsignor</types>
        <types>DocumentRef.OnlineReceipt</types>
        <types>DocumentRef.CashVoucher</types>
        <types>DocumentRef.PurchaseOrder</types>
        <types>DocumentRef.BulkMail</types>
        <types>DocumentRef.PaymentReceipt</types>
        <types>DocumentRef.OnlinePayment</types>
        <types>DocumentRef.SupplierQuote</types>
        <types>DocumentRef.DirectDebit</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Participants</name>
    <attributes>
      <name>Contact</name>
      <type>
        <types>CatalogRef.ContactPersons</types>
        <types>CatalogRef.Leads</types>
        <types>String</types>
        <types>CatalogRef.Counterparties</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>HowToContact</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>NumberForSending</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>MessageID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>DeliveryStatus</name>
      <type>
        <types>EnumRef.SMSStatus</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>AdditionalAttributes</name>
    <attributes>
      <name>Property</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.AdditionalAttributesAndInfo</types>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>Characteristic.AdditionalAttributesAndInfo</types>
      </type>
    </attributes>
    <attributes>
      <name>TextString</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Австралия/src/Enums/EventTypes/EventTypes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>EventTypes</name>
  <enumValues>
    <name>PhoneCall</name>
  </enumValues>
  <enumValues>
    <name>PersonalMeeting</name>
  </enumValues>
  <enumValues>
    <name>Email</name>
  </enumValues>
  <enumValues>
    <name>SMS</name>
  </enumValues>
  <enumValues>
    <name>Other</name>
  </enumValues>
</mdclass:Enum>

Австралия/src/Enums/IncomingOutgoingEvent/IncomingOutgoingEvent.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>IncomingOutgoingEvent</name>
  <enumValues>
    <name>Incoming</name>
  </enumValues>
  <enumValues>
    <name>Outgoing</name>
  </enumValues>
</mdclass:Enum>

Австралия/src/Enums/ContactInformationTypes/ContactInformationTypes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ContactInformationTypes</name>
  <enumValues>
    <name>Address</name>
  </enumValues>
  <enumValues>
    <name>Phone</name>
  </enumValues>
  <enumValues>
    <name>EmailAddress</name>
  </enumValues>
  <enumValues>
    <name>Skype</name>
  </enumValues>
  <enumValues>
    <name>WebPage</name>
  </enumValues>
  <enumValues>
    <name>Fax</name>
  </enumValues>
  <enumValues>
    <name>Other</name>
  </enumValues>
</mdclass:Enum>

Австралия/src/Documents/EmployeeTask/EmployeeTask.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>EmployeeTask</name>
  <basedOn>Document.Event</basedOn>
  <basedOn>Document.SalesOrder</basedOn>
  <registerRecords>AccumulationRegister.EmployeeTasks</registerRecords>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>OperationKind</name>
    <type>
      <types>EnumRef.OperationTypesEmployeeTask</types>
    </type>
  </attributes>
  <attributes>
    <name>State</name>
    <type>
      <types>CatalogRef.JobAndEventStatuses</types>
    </type>
  </attributes>
  <attributes>
    <name>WorkKind</name>
    <type>
      <types>CatalogRef.Products</types>
    </type>
  </attributes>
  <attributes>
    <name>PriceKind</name>
    <type>
      <types>CatalogRef.PriceTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>Employee</name>
    <type>
      <types>CatalogRef.Employees</types>
    </type>
  </attributes>
  <attributes>
    <name>StructuralUnit</name>
    <type>
      <types>CatalogRef.BusinessUnits</types>
    </type>
  </attributes>
  <attributes>
    <name>DocumentAmount</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>WorkKindPosition</name>
    <type>
      <types>EnumRef.AttributeStationing</types>
    </type>
  </attributes>
  <attributes>
    <name>Event</name>
    <type>
      <types>DocumentRef.Event</types>
    </type>
  </attributes>
  <attributes>
    <name>Comment</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Author</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Works</name>
    <attributes>
      <name>WorkKind</name>
      <type>
        <types>CatalogRef.Products</types>
      </type>
    </attributes>
    <attributes>
      <name>Customer</name>
      <type>
        <types>CatalogRef.CounterpartyContracts</types>
        <types>DocumentRef.SalesOrder</types>
        <types>CatalogRef.Counterparties</types>
      </type>
    </attributes>
    <attributes>
      <name>Products</name>
      <type>
        <types>CatalogRef.Products</types>
      </type>
    </attributes>
    <attributes>
      <name>Characteristic</name>
      <type>
        <types>CatalogRef.ProductsCharacteristics</types>
      </type>
    </attributes>
    <attributes>
      <name>Day</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>BeginTime</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>EndTime</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Duration</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>DurationInHours</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Price</name>
      <type>
        <types>DefinedType.Precision</types>
      </type>
    </attributes>
    <attributes>
      <name>Amount</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Comment</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>AdditionalAttributes</name>
    <attributes>
      <name>Property</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.AdditionalAttributesAndInfo</types>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>Characteristic.AdditionalAttributesAndInfo</types>
      </type>
    </attributes>
    <attributes>
      <name>TextString</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Австралия/src/Documents/Event/ObjectModule.bsl
#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then

#Region EventHandlers

Procedure Filling(FillingData, FillingText, StandardProcessing)
	
	If DataExchange.Load Then
		Return;
	EndIf;
	
	ObjectFillingDrive.FillDocument(ThisObject, FillingData, "FillingHandler");
	
EndProcedure

Procedure BeforeWrite(Cancel, WriteMode, PostingMode)
	
	If DataExchange.Load Then
		Return;
	EndIf;
	
	FillAttributeParticipantsList();
	FillPresentation();
	
EndProcedure

Procedure OnCopy(CopiedObject)
	
	If EventType = Enums.EventTypes.Email
		AND IncomingOutgoingEvent = Enums.IncomingOutgoingEvent.Incoming Then
		Raise NStr("en = 'You can not copy an incoming message.'; ru = 'Копирование входящего письма невозможно.';pl = 'Kopiowanie wiadomości wchodzącej nie jest możliwe.';es_ES = 'Usted no puede copiar un mensaje entrante.';es_CO = 'Usted no puede copiar un mensaje entrante.';tr = 'Gelen mesaj kopyalanamaz.';it = 'Non è possibile copiare un messaggio in arrivo.';de = 'Sie können eine eingehende Nachricht nicht kopieren.'");
	EndIf;
	
	If EventType = Enums.EventTypes.Email Or EventType = Enums.EventTypes.SMS Then
		EventBegin	= '00010101';
		EventEnding	= '00010101';
	Else
		EventBegin = CurrentSessionDate();
		EventBegin = BegOfHour(EventBegin) + ?(Minute(EventBegin) < 30, 1800, 3600);
		EventEnding = EventBegin + 1800;
	EndIf;
	
	State = Catalogs.JobAndEventStatuses.Planned;
	
EndProcedure

Procedure FillCheckProcessing(Cancel, CheckedAttributes)
	
	If DataExchange.Load Then
		Return;
	EndIf;
	
	If EventEnding < EventBegin Then
		CommonClientServer.MessageToUser(
			NStr("en = 'The end date cannot be earlier than the start date.'; ru = 'Дата окончания интервала не может быть меньше даты начала.';pl = 'Data zakończenia nie może być wcześniejsza od daty rozpoczęcia.';es_ES = 'La fecha del fin no puede ser anterior a la fecha del inicio.';es_CO = 'La fecha del fin no puede ser anterior a la fecha del inicio.';tr = 'Bitiş tarihi, başlangıç tarihinden önce olamaz.';it = 'La data di fine non può essere anteriore alla data di inizio.';de = 'Das Enddatum darf nicht vor dem Startdatum liegen.'"),
			ThisObject,
			"EventEnding",
			,
			Cancel
		);
	EndIf;
	
	// For the form of other events its own table of contacts is implemented
	If Not (EventType = Enums.EventTypes.Email Or EventType = Enums.EventTypes.SMS) Then
		CheckedAttributes.Delete(CheckedAttributes.Find("Participants.Contact"));
	EndIf;
	
	If EventType = Enums.EventTypes.Email Or EventType = Enums.EventTypes.SMS Then
		DriveServer.DeleteAttributeBeingChecked(CheckedAttributes, "Subject");
	EndIf;
	
EndProcedure

#EndRegion

#Region Interface
	
Procedure FillAttributeParticipantsList() Export
	
	ParticipantsList = "";
	For Each Participant In Participants Do
		ParticipantsList = ParticipantsList + ?(ParticipantsList = "","","; ")
			+ Participant.Contact + ?(IsBlankString(Participant.HowToContact), "", " <" + Participant.HowToContact + ">");
	EndDo;
	
EndProcedure

#EndRegion

#Region DocumentFillingProcedures

Procedure FillingHandler(FillingData) Export
	
	If TypeOf(FillingData) <> Type("Structure") Then
		Return;
	EndIf;
	
	If Not FillingData.Property("EventType") Then
		Return;
	EndIf;
	
	EventType = FillingData.EventType;
	
	If EventType <> Enums.EventTypes.Email
		AND EventType <> Enums.EventTypes.SMS Then
		
		If Not ValueIsFilled(EventBegin) Or Not ValueIsFilled(EventEnding) Then
			If FillingData.Property("EventBegin") Then
				EventBegin = FillingData.EventBegin;
			Else
				EventBegin = CurrentSessionDate();
			EndIf;
			If FillingData.Property("EventEnding") Then
				EventEnding = FillingData.EventEnding;
			Else
				EventEnding = EventBegin + 1800;
			EndIf;
		EndIf;
		
		If FillingData.Property("Lead") And TypeOf(FillingData.Lead) = Type("CatalogRef.Leads") Then
			FillByLead(FillingData.Lead);
		EndIf;
		
	EndIf;
	
	If FillingData.Property("Counterparty")
		AND TypeOf(FillingData.Counterparty) = Type("CatalogRef.Counterparties") Then
		FillByCounterparty(FillingData.Counterparty);
	EndIf;
	
	If FillingData.Property("Contact") Then
		
		If TypeOf(FillingData.Contact) = Type("CatalogRef.ContactPersons") Then
			ParticipantsRow = Participants.Add();
			ParticipantsRow.Contact = Common.ObjectAttributeValue(FillingData.Contact, "Owner");
		EndIf;
		
		ParticipantsRow = Participants.Add();
		ParticipantsRow.Contact = FillingData.Contact;
		
		If FillingData.Property("ValueCI") Then
			ParticipantsRow.HowToContact = FillingData.ValueCI;
		EndIf;
		
	EndIf;
	
	If FillingData.EventType = Enums.EventTypes.PhoneCall
		AND FillingData.Property("PhoneNumber") Then
		
		Content = StrTemplate(NStr("en = 'Call from number:%1.'; ru = 'Звонок с номера: %1.';pl = 'Połączenie z numeru:%1.';es_ES = 'Llamada del número:%1.';es_CO = 'Llamada del número:%1.';tr = 'Aşağıdaki numaradan çağrı: %1';it = 'Chiamata a partire dal numero:%1.';de = 'Aufruf von der Nummer: %1.'"), FillingData.PhoneNumber);
	EndIf;
	
	If Not FillingData.Property("FillingBasis") Then
		// Create a new event without basis
		FillByDefault();
		Return;
	EndIf;
	
	If TypeOf(FillingData.FillingBasis) = Type("CatalogRef.Counterparties") Then
		
		FillByCounterparty(FillingData.FillingBasis);
		
	ElsIf TypeOf(FillingData.FillingBasis) = Type("CatalogRef.Leads") Then
		
		FillByLead(FillingData.FillingBasis);
		
	ElsIf TypeOf(FillingData.FillingBasis) = Type("CatalogRef.ContactPersons") Then
		
		FillByContactPerson(FillingData.FillingBasis);
		
	ElsIf TypeOf(FillingData.FillingBasis) = Type("DocumentRef.Event") Then
		
		FillByEvent(FillingData);
		
	// begin Drive.FullVersion
	ElsIf TypeOf(FillingData.FillingBasis) = Type("DocumentRef.EmployeeTask") Then
		
		FillByEmployeeTask(FillingData.FillingBasis);
		
	// end Drive.FullVersion
		
	ElsIf TypeOf(FillingData.FillingBasis) = Type("DocumentRef.SalesOrder") Then
		
		FillBySalesOrder(FillingData.FillingBasis);
		
	// begin Drive.FullVersion	
	ElsIf TypeOf(FillingData.FillingBasis) = Type("DocumentRef.ProductionOrder") Then
		
		FillByProductionOrder(FillingData.FillingBasis);
		
	// end Drive.FullVersion
	
	ElsIf TypeOf(FillingData.FillingBasis) = Type("DocumentRef.ReconciliationStatement") Then
		
		FillByReconciliationStatement(FillingData.FillingBasis);
		
	ElsIf TypeOf(FillingData.FillingBasis) = Type("Structure") Then
		
		FillByStructure(FillingData.FillingBasis);
		
	ElsIf AvailableTypeForGeneratingOnBase(FillingData.FillingBasis) Then
		
		BasisDocuments.Clear();
		If EventType = Enums.EventTypes.Email Then
			BasisDocumentsRow = BasisDocuments.Add();
			BasisDocumentsRow.BasisDocument = FillingData.FillingBasis;
		Else
			BasisDocument = FillingData.FillingBasis;
		EndIf;
		
		Participants.Clear();
		ParticipantsRow = Participants.Add();
		ParticipantsRow.Contact = FillingData.FillingBasis.Counterparty;
		FillHowToContact();
		
	EndIf;
	
	FillByDefault();
	
EndProcedure

Procedure FillByStructure(FillingBasis)
	
	FillPropertyValues(ThisObject, FillingBasis);
	
	// begin Drive.FullVersion
	If FillingBasis.Property("Basis")
		AND TypeOf(FillingBasis.Basis)= Type("DocumentRef.EmployeeTask") Then
		
		FillByCurrentRowEmployeeTask(FillingBasis);
		Return;
		
	EndIf;
	// end Drive.FullVersion
	
	If FillingBasis.Property("BasisDocument")
		AND AvailableTypeForGeneratingOnBase(FillingBasis.BasisDocument) Then
		
		BasisDocuments.Clear();
		If EventType = Enums.EventTypes.Email Then
			BasisDocumentsRow = BasisDocuments.Add();
			BasisDocumentsRow.BasisDocument = FillingBasis.BasisDocument;
		Else
			BasisDocument = FillingBasis.BasisDocument;
		EndIf;
		
	EndIf;
	
	If FillingBasis.Property("Contact") AND ValueIsFilled(FillingBasis.Contact) Then
		
		Participants.Clear();
		
		If TypeOf(FillingBasis.Contact) = Type("CatalogRef.ContactPersons") Then
			ParticipantsRow = Participants.Add();
			ParticipantsRow.Contact = FillingBasis.Contact.Owner;
		EndIf;
		
		ParticipantsRow = Participants.Add();
		ParticipantsRow.Contact = FillingBasis.Contact;
		
		FillHowToContact();
		
	EndIf;
	
EndProcedure

Procedure FillByCounterparty(Counterparty)
	
	If Counterparty.IsFolder Then
		Raise NStr("en = 'You cannot select a counterparty group.'; ru = 'Нельзя выбирать группу контрагентов.';pl = 'Wybór grupy kontrahentów nie jest możliwy.';es_ES = 'Usted no puede seleccionar un grupo de contrapartes.';es_CO = 'Usted no puede seleccionar un grupo de contrapartes.';tr = 'Cari hesap grubu seçilemez.';it = 'Non è possibile selezionare un gruppo di controparte.';de = 'Sie können keine Geschäftspartnergruppe auswählen.'");
	EndIf;
	
	Participants.Clear();
	
	Query = New Query;
	Query.Text = 
		"SELECT ALLOWED
		|	ContactPersons.Ref
		|FROM
		|	Catalog.ContactPersons AS ContactPersons
		|WHERE
		|	ContactPersons.Owner = &Owner
		|	AND ContactPersons.DeletionMark = FALSE
		|
		|ORDER BY
		|	ContactPersons.Description";
	
	Query.SetParameter("Owner", Counterparty);
	
	Selection = Query.Execute().Select();
	
	While Selection.Next() Do
		ParticipantsRow	= Participants.Add();
		ParticipantsRow.Contact	= Selection.Ref;
	EndDo;
	
	RowParticipants = Participants.Insert(0);
	RowParticipants.Contact = Counterparty;
	FillHowToContact();
	
EndProcedure

Procedure FillByLead(Lead)
	
	Participants.Clear();
	
	TypesCI = New Array;
	
	If NOT EventType = Enums.EventTypes.SMS AND NOT EventType = Enums.EventTypes.PhoneCall Then
		TypesCI.Add(Enums.ContactInformationTypes.EmailAddress);
	EndIf;
	
	If NOT EventType = Enums.EventTypes.Email Then
		TypesCI.Add(Enums.ContactInformationTypes.Phone);
	EndIf;

	Query = New Query;
	Query.Text = 
	"SELECT ALLOWED
	|	CASE
	|		WHEN LeadsContactInformation.Type = VALUE(Enum.ContactInformationTypes.Phone)
	|			THEN 1
	|		ELSE 2
	|	END AS Order,
	|	LeadsContactInformation.Presentation AS Presentation,
	|	CAST(LeadsContacts.Representation AS STRING(1024)) AS Contact
	|FROM
	|	Catalog.Leads.ContactInformation AS LeadsContactInformation
	|		INNER JOIN Catalog.Leads.Contacts AS LeadsContacts
	|		ON LeadsContactInformation.ContactLineIdentifier = LeadsContacts.ContactLineIdentifier
	|			AND LeadsContactInformation.Ref = LeadsContacts.Ref
	|WHERE
	|	LeadsContactInformation.Ref = &Lead
	|	AND LeadsContactInformation.Type IN(&TypesCI)
	|
	|ORDER BY
	|	Order,
	|	LeadsContactInformation.LineNumber
	|TOTALS BY
	|	Contact";
	
	Query.SetParameter("Lead", Lead);
	Query.SetParameter("TypesCI", TypesCI);
	
	QueryResults = Query.Execute();
	
	FirstRow = True;
	
	Selection = QueryResults.Select(QueryResultIteration.ByGroups);
	While Selection.Next() Do
		
		HowToContact = "";
		
		HowToContactSelection = Selection.Select();
		While HowToContactSelection.Next() Do
			HowToContact = HowToContact + ?(HowToContact = "", "", ", ") + HowToContactSelection.Presentation;
		EndDo;
		
		If FirstRow Then
			
			RowParticipants = Participants.Add();
			RowParticipants.Contact = Lead;
			
			FirstRow = False
			
		EndIf;
		
		RowParticipants = Participants.Add();
		RowParticipants.Contact = Selection.Contact;
		RowParticipants.HowToContact = HowToContact;
		
	EndDo;
	
EndProcedure

Procedure FillByContactPerson(ContactPerson)
	
	Participants.Clear();
	
	TypesCI = New Array;
	If Not EventType = Enums.EventTypes.SMS Then
		TypesCI.Add(Enums.ContactInformationTypes.EmailAddress);
	EndIf;
	If Not EventType = Enums.EventTypes.Email Then
		TypesCI.Add(Enums.ContactInformationTypes.Phone);
	EndIf;
	
	Query = New Query;
	Query.Text = 
		"SELECT ALLOWED
		|	CASE
		|		WHEN CounterpartiesContactInformation.Type = VALUE(Enum.ContactInformationTypes.Phone)
		|			THEN 1
		|		ELSE 2
		|	END AS Order,
		|	CounterpartiesContactInformation.Presentation
		|FROM
		|	Catalog.Counterparties.ContactInformation AS CounterpartiesContactInformation
		|WHERE
		|	CounterpartiesContactInformation.Ref = &Counterparty
		|	AND CounterpartiesContactInformation.Type IN(&TypesCI)
		|
		|ORDER BY
		|	Order,
		|	CounterpartiesContactInformation.LineNumber
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|SELECT ALLOWED
		|	CASE
		|		WHEN ContactPersonsContactInformation.Type = VALUE(Enum.ContactInformationTypes.Phone)
		|			THEN 1
		|		ELSE 2
		|	END AS Order,
		|	ContactPersonsContactInformation.Presentation
		|FROM
		|	Catalog.ContactPersons.ContactInformation AS ContactPersonsContactInformation
		|WHERE
		|	ContactPersonsContactInformation.Ref = &ContactPerson
		|	AND ContactPersonsContactInformation.Type IN(&TypesCI)
		|
		|ORDER BY
		|	Order,
		|	ContactPersonsContactInformation.LineNumber";
	
	Query.SetParameter("Counterparty", ContactPerson.Owner);
	Query.SetParameter("ContactPerson", ContactPerson);
	Query.SetParameter("TypesCI", TypesCI);
	
	ResultsArray = Query.ExecuteBatch();
	
	Selection = ResultsArray[0].Select();
	HowToContact = "";
	
	While Selection.Next() Do
		HowToContact = HowToContact + ?(HowToContact = "", "", ", ") + Selection.Presentation;
	EndDo;
	
	RowParticipants = Participants.Add();
	RowParticipants.Contact = ContactPerson.Owner;
	RowParticipants.HowToContact = HowToContact;
	
	Selection = ResultsArray[1].Select();
	HowToContact = "";
	
	While Selection.Next() Do
		HowToContact = HowToContact + ?(HowToContact = "", "", ", ") + Selection.Presentation;
	EndDo;
	
	RowParticipants = Participants.Add();
	RowParticipants.Contact = ContactPerson;
	RowParticipants.HowToContact = HowToContact;
	
EndProcedure

Procedure FillByEvent(FillingData)
	
	Participants.Clear();
	
	// Filling participants
	If CommonClientServer.StructureProperty(
		FillingData,
		"Command",
		EmailDriveClientServer.CommandReply()) = EmailDriveClientServer.CommandReply() Then
		
		Query = New Query(
		"SELECT ALLOWED
		|	EventParticipants.Contact AS Contact,
		|	EventParticipants.HowToContact AS HowToContact
		|FROM
		|	Document.Event.Participants AS EventParticipants
		|WHERE
		|	EventParticipants.Ref = &Ref
		|
		|ORDER BY
		|	EventParticipants.LineNumber");
		
		Query.SetParameter("Ref", FillingData.FillingBasis);
		
		Selection = Query.Execute().Select();
		
		While Selection.Next() Do
			ParticipantsRow = Participants.Add();
			ParticipantsRow.Contact			= Selection.Contact;
			ParticipantsRow.HowToContact	= Selection.HowToContact;
		EndDo;
		
	EndIf;
		
	// Filling of basis documents
	BasisDocuments.Clear();
	If EventType = Enums.EventTypes.Email Then
		BasisDocumentsRow = BasisDocuments.Add();
		BasisDocumentsRow.BasisDocument = FillingData.FillingBasis;
		FillEmailSubject(FillingData);
	Else
		BasisDocument = FillingData.FillingBasis;
	EndIf;
	
	UserAccount = Common.ObjectAttributeValue(FillingData.FillingBasis, "UserAccount");
	
EndProcedure

Procedure FillByReconciliationStatement(FillingData)
	
	IncomingOutgoingEvent = Enums.IncomingOutgoingEvent.Outgoing;
	BasisDocument = FillingData.Ref;
	Counterparty = FillingData.Counterparty;
	
	Participants.Clear();
	If ValueIsFilled(BasisDocument.CounterpartyRepresentative) Then
		
		ContactPerson = BasisDocument.CounterpartyRepresentative;
		
		NewRow = Participants.Add();
		NewRow.Contact = ContactPerson;
		
		HowToContactPhone = ContactsManager.ObjectContactInformation(ContactPerson, Catalogs.ContactInformationKinds.ContactPersonPhone);
		HowToContactEmail = ContactsManager.ObjectContactInformation(ContactPerson, Catalogs.ContactInformationKinds.ContactPersonEmail);
		
		If IsBlankString(HowToContactPhone) Then
			NewRow.HowToContact = TrimAll(HowToContactEmail);
		ElsIf IsBlankString(HowToContactEmail) Then
			NewRow.HowToContact = TrimAll(HowToContactPhone);
		Else
			NewRow.HowToContact = TrimAll(HowToContactPhone) + "; " + TrimAll(HowToContactEmail);
		EndIf;
		
	EndIf;
	
	BasisDocuments.Clear();
	If EventType = Enums.EventTypes.Email Then
		RowDocumentsBases = BasisDocuments.Add();
		RowDocumentsBases.BasisDocument = BasisDocument;
	EndIf;
	
EndProcedure

// begin Drive.FullVersion
Procedure FillByEmployeeTask(EmployeeTask)
	
	Participants.Clear();
	
	// Filling out a document header.
	Query = New Query;
	Query.SetParameter("Ref", EmployeeTask);
	
	Query.Text =
	"SELECT ALLOWED TOP 1
	|	CASE
	|		WHEN VALUETYPE(Works.Customer) = TYPE(Catalog.Counterparties)
	|			THEN Works.Customer
	|		WHEN VALUETYPE(Works.Customer) = TYPE(Catalog.CounterpartyContracts)
	|			THEN Works.Customer.Owner
	|		WHEN VALUETYPE(Works.Customer) = TYPE(Document.SalesOrder)
	|			THEN Works.Customer.Counterparty
	|		ELSE VALUE(Catalog.Counterparties.EmptyRef)
	|	END AS Counterparty,
	|	Works.BeginTime AS EventBegin,
	|	Works.EndTime AS EventEnding,
	|	Works.Day AS Day
	|FROM
	|	Document.EmployeeTask.Works AS Works
	|WHERE
	|	Works.Ref = &Ref";
	
	QueryResult = Query.Execute();
	
	If Not QueryResult.IsEmpty() Then
		
		Selection = QueryResult.Select();
		Selection.Next();
		FillPropertyValues(ThisObject, Selection);
		
		If ValueIsFilled(Selection.Counterparty) Then
			ParticipantsRow = Participants.Add();
			ParticipantsRow.Contact = Selection.Counterparty;
			FillHowToContact();
		EndIf;
		
	EndIf;
	
	BasisDocuments.Clear();
	If EventType = Enums.EventTypes.Email Then
		RowDocumentsBases = BasisDocuments.Add();
		RowDocumentsBases.BasisDocument = EmployeeTask;
	Else
		BasisDocument = EmployeeTask;
	EndIf;
	
EndProcedure
// end Drive.FullVersion

Procedure FillBySalesOrder(SalesOrder)
	
	BasisDocuments.Clear();
	If EventType = Enums.EventTypes.Email Then
		RowDocumentsBases = BasisDocuments.Add();
		RowDocumentsBases.BasisDocument = SalesOrder;
	Else
		BasisDocument = SalesOrder;
	EndIf;
	Project = SalesOrder.Project;
	
	Participants.Clear();
	RowParticipants = Participants.Add();
	RowParticipants.Contact = SalesOrder.Counterparty;
	FillHowToContact();
	
EndProcedure

// begin Drive.FullVersion
Procedure FillByProductionOrder(ProductionOrder)
	
	BasisDocuments.Clear();
	If EventType = Enums.EventTypes.Email Then
		BasisDocumentsRow = BasisDocuments.Add();
		BasisDocumentsRow.BasisDocument = ProductionOrder;
	Else
		BasisDocument = ProductionOrder;
	EndIf;
	
	If EventType <> Enums.EventTypes.Email
		И EventType <> Enums.EventTypes.SMS Then
		
		EventBegin	= ProductionOrder.Start;
		EventEnding	= ProductionOrder.Finish;
	EndIf;
	
EndProcedure
// end Drive.FullVersion

// begin Drive.FullVersion
Procedure FillByCurrentRowEmployeeTask(FillingStructure)
	
	Participants.Clear();
	BasisDocuments.Clear();
	If EventType = Enums.EventTypes.Email Then
		RowDocumentsBases = BasisDocuments.Add();
		RowDocumentsBases.BasisDocument = FillingStructure.Basis;
	Else
		BasisDocument = FillingStructure.Basis;
	EndIf;
	
	If TypeOf(FillingStructure.Customer) = Type("CatalogRef.Counterparties") Then
		RowParticipants = Participants.Add();
		RowParticipants.Contact = FillingStructure.Customer;
	ElsIf TypeOf(FillingStructure.Customer) = Type("CatalogRef.CounterpartyContracts") Then
		RowParticipants = Participants.Add();
		RowParticipants.Contact = FillingStructure.Customer.Owner;
	ElsIf TypeOf(FillingStructure.Customer) = Type("DocumentRef.SalesOrder") Then
		RowParticipants = Participants.Add();
		RowParticipants.Contact = FillingStructure.Customer.Counterparty;
	EndIf;
	
	If RowParticipants <> Undefined AND ValueIsFilled(RowParticipants.Contact) Then
		FillHowToContact();
	EndIf;
	
	EventBegin	= FillingStructure.EventBegin;
	EventEnding	= FillingStructure.EventEnding;
	
	Responsible = DriveReUse.GetValueByDefaultUser(Users.CurrentUser(), "MainResponsible");
	
EndProcedure
// end Drive.FullVersion

Procedure FillHowToContact()
	
	Counterparties = Participants.UnloadColumn("Contact");
	CommonClientServer.DeleteAllTypeOccurrencesFromArray(Counterparties, Type("String"));
	ContactPersons = CommonClientServer.CopyArray(Counterparties);
	CommonClientServer.DeleteAllTypeOccurrencesFromArray(Counterparties, Type("CatalogRef.ContactPersons"));
	CommonClientServer.DeleteAllTypeOccurrencesFromArray(ContactPersons, Type("CatalogRef.Counterparties"));
	
	TypesCI = New Array;
	If Not EventType = Enums.EventTypes.SMS AND Not EventType = Enums.EventTypes.PhoneCall Then
		TypesCI.Add(Enums.ContactInformationTypes.EmailAddress);
	EndIf;
	If Not EventType = Enums.EventTypes.Email Then
		TypesCI.Add(Enums.ContactInformationTypes.Phone);
	EndIf;
	
	If Counterparties.Count() > 0 Then
		TableCI_Counterparties = ContactsManager.ObjectsContactInformation(Counterparties, TypesCI);
		TableCI_Counterparties.Sort("Object Asc, Type Desc");
	EndIf;
	
	If ContactPersons.Count() > 0 Then
		TableCI_ContactPersons = ContactsManager.ObjectsContactInformation(ContactPersons, TypesCI);
		TableCI_ContactPersons.Sort("Object Asc, Type Desc");
	EndIf;
	
	Filter = New Structure("Object");
	Index = 0;
	
	While Index <= Participants.Count()-1 Do
		
		CurRow = Participants[Index];
		Filter.Object = CurRow.Contact;
		RowsCI = New Array;
		
		If TypeOf(CurRow.Contact) = Type("CatalogRef.Counterparties") AND TableCI_Counterparties <> Undefined AND TableCI_Counterparties.Count() > 0 Then
			RowsCI = TableCI_Counterparties.FindRows(Filter);
		ElsIf TypeOf(CurRow.Contact) = Type("CatalogRef.ContactPersons") AND TableCI_ContactPersons <> Undefined AND TableCI_ContactPersons.Count() > 0 Then
			RowsCI = TableCI_ContactPersons.FindRows(Filter);
		EndIf;
		
		// For SMS, each phone on a new line
		// For other types of events, we display the contact information in one line
		
		If EventType = Enums.EventTypes.SMS Then
			FirstValueCI = True;
			For Each RowCI In RowsCI Do
				If Not FirstValueCI Then
					Index = Index + 1;
					CurRow = Participants.Insert(Index);
					CurRow.Contact = Filter.Object;
				EndIf;
				CurRow.HowToContact = RowCI.Presentation;
				FirstValueCI = False;
			EndDo;
		Else
			For Each RowCI In RowsCI Do
				CurRow.HowToContact = "" + CurRow.HowToContact + ?(CurRow.HowToContact = "", "", ", ") + RowCI.Presentation;
			EndDo;
		EndIf;
		
		Index = Index + 1;
		
	EndDo;
	
EndProcedure

Function AvailableTypeForGeneratingOnBase(DocBasis)
	
	Return Common.HasObjectAttribute(
	"Counterparty",
	DocBasis.Metadata());
	
EndFunction

#EndRegion

#Region InterfaceEmployeeCalendar

Procedure FillByDefault()
	
	
EndProcedure

#EndRegion

#Region ServiceProceduresAndFunctionsEmail

Procedure FillEmailSubject(FillingData)
	
	EventAttributesValues = Common.ObjectAttributesValues(FillingData.FillingBasis, "Subject, IncomingOutgoingEvent");
	If EventAttributesValues.IncomingOutgoingEvent <> Enums.IncomingOutgoingEvent.Incoming Then
		Return;
	EndIf;
	
	Subject = Documents.Event.SubjectWithResponsePrefix(
	EventAttributesValues.Subject,
	CommonClientServer.StructureProperty(
	FillingData,
	"Command",
	EmailDriveClientServer.CommandReply()));

EndProcedure

Procedure FillPresentation()
	
	
EndProcedure

#EndRegion

#EndIf
